id = 1
formula = '01'

x = [
    ['скорость равномерного прямолинейного движения', 'скоростью равномерного прямолинейного движения называют постоянную векторную величину, \
        численно равную пермещению, которое совершает тело за единицу времени','м/с'],
    ['проекция скорости на координатную ось', 'проекция сорости на координатную \
     ось равна изменению координаты в единицу времени', 'м/с'],
    ['перемещение', 'перемещение при равномерном прямолинейном \
движении равно произведению скорости на время этого перемещения','м'],
    ['проекция перемещения на координатную ось', 'проекция перемещения, \
     при равномерном прямолинейном перемещении равна изменению координаты', 'м'],
    ['средняя скорость при неравномерном прямолинейном движении', 'средняя скорость при неравномерном прямолинейном движении\
равна отношению перемещения на время, в течение которого оно совершено', 'м'],
    ['ускорение', 'ускорение тела при его равноускоренном движении - величина, равная отношению изменения\
скорости к промежутку времени в течение которого это изменение произошло', 'м/с'],
    ['скорость равноускоренного прямолинейного движения', 'скорость тела в любой момент времени\
равноускоренного прямолинейного движения определяется начальной скоростью тела и его ускорением', 'м/с'],
    ['перемещение', 'перемещение тела в любой момент времени равноускоренного прямолинейного движения определяется\
начальной скоростью тела и его конечной скоростью', 'м'],
    ['координата тела', 'координата тела в любой момент времени, определяется начальной координатой,\
начальной скоростью и ускорением', 'м'],
    ['ускорение свободного падения', 'ускорение свободного падения одинаково для всех тел на данной широте\
Земного шара', 'м/с^2'],
    ['угловая скорость', 'угловая скорость тела при равномерном движении по окружности характеризует быстроту изменения угла\
поворота и: а) равна отношению изменения угла поворота к промежутку времени, за которое это изменение произошло; \n \
б) определяется отношением линейной скорости к радиусу окружности; \n в) пропорциональна частоте обращения; \n \
г) обратно пропорциональна периоду обращения.', 'рад/с'],
    ['частота обращения', 'частота обращения - число оборотов по окружности в единицу времени - величина, обратная\
периоду обращения.', '1/с'],
    ['период обращения', 'период обращения - время совершения телом одного полного оборота.', 'с'],
    ['линейная скорость', 'скорость тела при равномерном движении по окружности:\n а) пропорциональна длине окружности\
и обратно пропорциональна периоду обращения; \n б) пропорциональна длине окружности и частоте обращения.', 'м/с'],
    ['центро-стремительное ускорение', 'ускорение тела, равномерно движущегося по окружности, направлено по радиусу\
окружности к её центру и: \n а) пропорционально квадрату скорости и обратно пропорционально радиусу окружности; \n\
б) связано с периодом обращения и частотой обращения несколькими формулами.', 'м/с^2'],
    ['первый закон Ньютона', 'существуют такие системы отсчета, относительно которых тело сохраняет состояния покоя или\
равномерного прямолинейного движения, если на него не действуют другие тела или равнодействующая всех приложенных к телу сил\
равна нулю.', 'отсутствует'],
    ['второй закон Ньютона', 'Равнодействующая всех сил, приложенных к телу, равна произведению массы тела на его ускорение,\
сообщенное этими силами.', 'Н'],
    ['третий закон Ньютона', 'тела действуют друг на друга с силами, равными по модулю и противоположными по направлению.', 'Н'],
    ['закон Гука', 'сила упругости, возникающая при деформации тела, пропорциональна удлинению тела и направлена противоположно\
направлению перемещения частиц тела при деформации.', 'Н'],
    ['закон всемирного тяготения', 'тела притягиваются друг к другу с силой, модуль которой пропорционален произведению их масс\
и обратно пропорционален квадрату расстояния между их центрами масс.', 'Н'],
    ['гравитационная постоянная', 'гравитационная постоянная численно равна силе притяжения двух точечных тел массой 1 кг\
каждое при расстоянии между ними 1 м.', '(Н*м^2)/кг^2'],
    ['сила тяжести', 'сила тяжести равна произведению массы тела на ускорение свободного падения.', 'Н'],
    ['ускорение свободного падения', 'G - гравитационная постоянная; M - масса Земли; R - радиус Земли.', 'м/с^2'],
    ['вес покоящихся и движущихся тел', 'вес тела: \nа)в состоянии покоя или движущегося равномерно и прямолинейно;\n\
б) движущегося вверх с ускорением;\nв) движущегося вниз с ускорением;\nг) движущегося со скоростью на выпуклой поверхности\
радиусом в верхней точке;\nд) движущегося со скоростью на вогнутой поверхности радиусом в нижней точки;\nе) в невесомости.', 'Н'],
    ['движение тела под углом к горизонту', 'Если начальная скорость тела направлена под углом к горизонту, то см.формулы.', 'м/с,\
м, м, с, с, м, м'],
    ['горизонтально брошенное тело', 'если тело брошено горизонтально с высоты с начальной скоростью, то: (см.формулы)\n\
а) время падения\nб) дальность падения\nв) высота полёта.', 'с, м, м'],
    ['скорость искусственного спутника Земли', 'скорость тела в горизонтальном направлении, при которой оно двигается по\
окружности вокруг Земли.', 'м/с'],
    ['трение покоя', 'максимальная сила трения покоя пропорциональна силе нормального давления и зависит от характера\
взаимодействия соприкасающихся поверхностей тел, определяемого коэффициентом трения.', 'Н'],
    ['трение скольжения', 'сила трения скольжения пропорциональна силе давления, коэффициенту трения и направлена\
противоположно направлению движения тела.', 'Н'],
    ['коэффициент трения', 'коэффициент трения вычисляют как отношение модулей силы трения и силы давления.', 'Отсутствует'],
    ['движение тела под действием силы трения', 'а) Путь, пройденный движущимся телом под действием силы трения до полной\
остановки(тормозной путь), прямо пропорционален квадрату начальной скорости и обратно пропорционален коэффициенту трения.\n\
б) Время движения тела под действием силы трения до момента полной остановки (время торможения) прямо пропорционально начальной\
скорости и обратно пропорционально коэффициенту трения.', 'м, с'],
    ['условие равновесия тела', 'тело находится в равновесии (в покое или движется равномерно и прямолинейно), если сумма\
проекций всех сил, действующих на тело, на любую ось равна нулю.', 'Н'],
    ['движение тела по наклонной плоскости', 'ускорение тела, скользящего вниз по наклонной плоскости с углом наклона и \
коэффициентом трения тела о плоскость, не зависит от массы тела.', 'м/с^2'],
    ['движение связанных тел через неподвижный блок', 'ускорение двух тел, связанных нитью, перекинутой через неподвижный\
блок.', 'м/с^2'],
    ['импульс тела', 'импульс тела - векторная величина, равная произведению массы тела на его скорость.', '(кг*м)/с'],
    ['импульс силы', 'импульс силы равен изменению импульса тела.', 'Н*с'],
    ['закон сохранения импульса', 'геометрическая сумма импульсов тел, составляющих замкнутую систему, остается постоянной\
при любых движениях и взаимодействиях тел системы.', 'Н*с'],
    ['механическая работа силы', 'работа постоянной силы равна произведению модулей векторов силы и перемещения на косинус угла\
между этими векторами', 'Дж'],
    ['теорема о кинетической энергии', 'работа силы (или равнодействующей сил) равна изменению кинетической энергии\
движущегося тела.', 'Дж'],
    ['потенциальная энергия поднятого тела', 'потенциальная энергия тела, поднятого на некоторую высоту над нулевым уровнем,\
равна работе силы тяжести при падении тела с этой высоты до нулевого уровня.', 'Дж'],
    ['работа силы тяжести', 'работа силы тяжести не зависит от пути, пройденного телом, а определяется разностью высот положения\
тела в конце и в начале пути и равна разности его потенциальных энергий.', 'Дж'],
    ['потенциальная энергия деформированного тела', 'потенциальная энергия дефомированного тела (пружины) равна работе силы\
упругости при переходе тела в состояние, в котором его деформация равна нулю.', 'Дж'],
    ['закон сохранения полной механической энергии', 'полная механическая энергия замкнутой системы тел, взаимодействующих\
силами тяготения или силами упругости, остается неизменной при любых движениях тел системы.', 'Дж'],
    ['закон Бернулли', 'давление жидкости, текущей в трубе, больше в тех частях трубы, где скорость её движения меньше\
и наоборот, в тех частях, где скорость больше, давление меньше.', 'Па']
    ]

i = 0
for i in range(len(x)):
    #x[i].insert(0, id)
    x[i].insert(3, formula)
 
    i += 1
    id += 1

    c1 = '0'
    c2 = str(i+1)
    formula = c1 + c2

    
